import type {Mpath} from "./Type"

//小标签栏

//风格类型
const styleNav:Mpath.TstyleNav = {
    "real":["全部","人物","动物","食物","服饰","交通工具","SDXL","光影","女神","武侠","唯美"],
    "eranimation":["全部","卡通","动漫","Q版","IP角色","福瑞","王者荣耀","原神","效果类","女生","二次元"],
    "tfD":["全部","奇幻","玄幻","科幻","机甲","赛博朋克","美女","女生","IP角色","古风","美少女"],
    "national":["全部","国风","武侠","神话","中国龙","国风绘画","国漫女神","美女","SDXL","动漫","写真"],
    "game":["场景设计","图标设计","人物设计","道具设计","幻想","少女","插画","Q版","SDXL","游戏角色","美女"]    
}

//模型小标签栏

const modelNav:string[] = ["模型","我关注的","全部","文创周吉祥物IP","加密龙王","索泰AI形象设计",
                            "SDXL","动漫","美女","男性","真实","风格","国风","科幻","建筑","摄影",
                            "风景","机甲","服饰","游戏","科技","卡通","动物","3D","2.5D","汽车",
                            "设计","食物","细节调整"] 


//帖子小标签栏
const postNav:string[] = ["全部","动漫","SDXL","2.5D","游戏","女神","自然","科幻","赛博朋克","插画设计","东方神话","中国风","建筑及空间设计","logo图标","植物","产品设计","男生","汽车交通"]


export default {
    styleNav,
    modelNav,
    postNav
}